app/views/weeks/index.html.erb

SELECT "wines".* FROM "wines"  WHERE "wines"."week_id" = ?  [["week_id", 1]]
---
      <h1>Week <%= week.week_number %></h1>
      <% week.wine.each do |wines| %>