app/controllers/comments_controller.rb

INSERT INTO "comments" ("created_at", "savor", "see", "sip", "smell", "swallow", "swirl", "updated_at", "user_id", "wine_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @comment = Comment.new(comment_params)
    flash[:notice] = 'Comment was successfully created.' if @comment.save

UPDATE "comments" SET "sip" = ?, "updated_at" = ? WHERE "comments"."id" = 3  [["sip", "asdasd"], ["updated_at", "2014-12-04 22:38:54.527963"]]
---
  def update
    flash[:notice] = 'Comment was successfully updated.' if @comment.update(comment_params)