app/controllers/weeks_controller.rb

  def index
    @weeks = Week.all.page(params[:page]).per_page(1)
    @comments = Comment.all
---
SELECT  "weeks".* FROM "weeks"   ORDER BY "weeks"."id" ASC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "weeks"
SELECT "comments".* FROM "comments"

  def create
    @week = Week.new(week_params)
    flash[:notice] = 'Week was successfully created.' if @week.save
---
INSERT INTO "weeks" ("class_id", "created_at", "updated_at", "week_number") VALUES (?, ?, ?, ?)  [["class_id", 1], ["created_at", "2014-10-13 14:41:19.078839"], ["updated_at", "2014-10-13 14:41:19.078839"], ["week_number", 1]]

    def set_week
      @week = Week.find(params[:id])
---
SELECT  "weeks".* FROM "weeks"  WHERE "weeks"."id" = ? LIMIT 1  [["id", 1]]