app/controllers/wines_controller.rb

SELECT "wines".* FROM "wines"
---
  def index
    @wines = Wine.all

INSERT INTO "wines" ("alcohol_percentage", "country", "created_at", "grape", "price", "producer", "region", "updated_at", "vintage", "week_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @wine = Wine.new(wine_params)
    flash[:notice] = 'Wine was successfully created.' if @wine.save

UPDATE "wines" SET "grape" = ?, "price" = ?, "producer" = ?, "region" = ?, "updated_at" = ?, "vintage" = ? WHERE "wines"."id" = 2  [["grape", "Savion Blanc"], ["price", "$20.00"], ["producer", "B"], ["region", "California"], ["updated_at", "2014-11-26 23:00:26.229605"], ["vintage", "2013"]]
---
  def update
    flash[:notice] = 'Wine was successfully updated.' if @wine.update(wine_params)

SELECT  "wines".* FROM "wines"  WHERE "wines"."id" = ? LIMIT 1  [["id", 9]]
---
    def set_wine
      @wine = Wine.find(params[:id])